server/artillery.yml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 15
      arrivalRate: 3
      name: warmup
    - duration: 30
      arrivalRate: 5
      name: baseline
scenarios:
  - name: feed workflow
    flow:
      - get:
          url: "/health"
      - post:
          url: "/api/feeds"
          json:
            quantity_ml: "{{ $randomNumber(1,500) }}"
      - get:
          url: "/api/feeds?limit=5"